cfd/disco_fine/Allmesh
#!/bin/bash
set -e
cd "$(dirname "$0")"
. /opt/openfoam14/etc/bashrc
blockMesh > log.blockMesh 2>&1
checkMesh > log.checkMesh 2>&1 || true
tail -25 log.checkMesh
