cfd/disco_fine/constant/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  14
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


disco
{
    type            semiImplicitSource;
    cellZone
    {
        type            cylinder;
        point1          (0.895 0 0);
        point2          (0.905 0 0);
        radius          0.03;
    }
    volumeMode      absolute;
    sources { U { explicit (7.17e-06 0 0); implicit 0; } }
}
